# language: ja
フィーチャ: トップページには直近のRubyKaigiのトップページであること

  シナリオテンプレート: rubykaigi.orgにアクセスする
    前提 言語は"<言語>"
    もし "トップページ"にアクセスする
    ならば "<イベント名>"が表示されていること

    例:
    |言語   |イベント名       |
    |ja-JP  |日本Ruby会議2010 |
    |en-US  |RubyKaigi2010    |
    |ja     |日本Ruby会議2010 |
    |en     |RubyKaigi2010    |
    |zh-TW  |RubyKaigi2010    |

  テンプレ: 西暦だけでアクセスする
    前提 言語は"<言語>"
    もし "/<西暦>/"にアクセスする
    ならば "<名前><西暦>"が表示されていること

    例:
    |言語| 西暦| 名前 |
    |ja-JP| 2010| 日本Ruby会議|
    |en   | 2010| RubyKaigi|

  シナリオ: 年にスラッシュなしでアクセス
    前提 言語は"en"
    もし "/2010"にアクセスする
    ならば "RubyKaigi 2010"が表示されていること
