# language: ja
フィーチャ: トップページには直近のRubyKaigiのトップページであること

  シナリオテンプレート: rubykaigi.orgにアクセスする
    前提 言語は"<言語>"
    もし "トップページ"にアクセスする
    ならば "<イベント名>"が表示されていること

    例:
      |言語   |イベント名      |
      |ja-JP  |日本Ruby会議2010|
      |en-US  |RubyKaigi 2010  |
      |ja     |日本Ruby会議2010|
      |en     |RubyKaigi 2010  |
      |zh-TW  |RubyKaigi 2010  |

  テンプレ: 西暦だけでアクセスする
    前提 言語は"<言語>"
    もし "/<西暦>/"にアクセスする
    ならば "<イベント名>"が表示されていること

    例:
      |言語 |西暦|イベント名      |
      |ja-JP|2010|日本Ruby会議2010|
      |en   |2010|RubyKaigi 2010  |

  シナリオ: 年にスラッシュなしでアクセス
    前提 言語は"en"
    もし "/2010"にアクセスする
    ならば "RubyKaigi"が表示されていること
